<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Taca-cvs] doc 01.tex,1.2,1.3 02.tex,1.7,1.8 03.tex,1.5,1.6 04.tex,1.3,1.4 05.tex,1.2,1.3
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/taca-cvs/2004-June/index.html" >
   <LINK REL="made" HREF="mailto:taca-cvs%40lists.berlios.de?Subject=Re%3A%20%5BTaca-cvs%5D%20doc%2001.tex%2C1.2%2C1.3%2002.tex%2C1.7%2C1.8%2003.tex%2C1.5%2C1.6%2004.tex%2C1.3%2C1.4%2005.tex%2C1.2%2C1.3&In-Reply-To=%3C200406191324.i5JDOHB06397%40bat.berlios.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000054.html">
   <LINK REL="Next"  HREF="000056.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Taca-cvs] doc 01.tex,1.2,1.3 02.tex,1.7,1.8 03.tex,1.5,1.6 04.tex,1.3,1.4 05.tex,1.2,1.3</H1>
    <B>albertfc</B> 
    <A HREF="mailto:taca-cvs%40lists.berlios.de?Subject=Re%3A%20%5BTaca-cvs%5D%20doc%2001.tex%2C1.2%2C1.3%2002.tex%2C1.7%2C1.8%2003.tex%2C1.5%2C1.6%2004.tex%2C1.3%2C1.4%2005.tex%2C1.2%2C1.3&In-Reply-To=%3C200406191324.i5JDOHB06397%40bat.berlios.de%3E"
       TITLE="[Taca-cvs] doc 01.tex,1.2,1.3 02.tex,1.7,1.8 03.tex,1.5,1.6 04.tex,1.3,1.4 05.tex,1.2,1.3">nobody at sheep.berlios.de
       </A><BR>
    <I>Sat Jun 19 15:24:17 CEST 2004</I>
    <P><UL>
        <LI>Previous message: <A HREF="000054.html">[Taca-cvs] codi Makefile,1.1,NONE generic.h,1.2,NONE inode.c,1.1,NONE linux_tacafs.c,1.1,NONE mosix.c,1.4,NONE rkfs.c,1.3,NONE
</A></li>
        <LI>Next message: <A HREF="000056.html">[Taca-cvs] doc 00-taca.tex,1.3,1.4
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#55">[ date ]</a>
              <a href="thread.html#55">[ thread ]</a>
              <a href="subject.html#55">[ subject ]</a>
              <a href="author.html#55">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Update of /cvsroot/taca/doc
In directory sheep:/tmp/cvs-serv4602/doc

Modified Files:
	01.tex 02.tex 03.tex 04.tex 05.tex 
Log Message:
Passat el corrector ortogr&#224;fic
A veure i apreneu a escriu-re amb accents, que no &#233;s tant dif&#237;cil!!1



Index: 01.tex
===================================================================
RCS file: /cvsroot/taca/doc/01.tex,v
retrieving revision 1.2
retrieving revision 1.3
diff -C2 -d -r1.2 -r1.3
*** 01.tex	17 Jun 2004 19:23:39 -0000	1.2
--- 01.tex	19 Jun 2004 13:24:15 -0000	1.3
***************
*** 14,22 ****
  interf&#237;cie comuna.
  
! Hem anomenat al sistema TACA, que v&#233; de l'angl&#232;s Transparent Architecture for
  Cluster Administration (Arquitectura Transparent per a l'Administraci&#243; de
  Cl&#250;sters).
  
  Tant la documentaci&#243; com la implementaci&#243; es troben disponibles a la p&#224;gina del
! projecte, que es troba a \textit{<A HREF="http://developer.berlios.de/projects/taca">http://developer.berlios.de/projects/taca</A>}.
  
--- 14,22 ----
  interf&#237;cie comuna.
  
! Hem anomenat al sistema TACA, que ve de l'angl&#232;s Transparent Architecture for
  Cluster Administration (Arquitectura Transparent per a l'Administraci&#243; de
  Cl&#250;sters).
  
  Tant la documentaci&#243; com la implementaci&#243; es troben disponibles a la p&#224;gina del
! projecte, que es troba a \textbf{<A HREF="http://developer.berlios.de/projects/taca">http://developer.berlios.de/projects/taca</A>}.
  

Index: 02.tex
===================================================================
RCS file: /cvsroot/taca/doc/02.tex,v
retrieving revision 1.7
retrieving revision 1.8
diff -C2 -d -r1.7 -r1.8
*** 02.tex	17 Jun 2004 19:23:39 -0000	1.7
--- 02.tex	19 Jun 2004 13:24:15 -0000	1.8
***************
*** 21,26 ****
  que planegen ampliar la capacitat del seu sistema han de considerar servidors
  &quot;high end&quot; costosos que proporcionen espai per a CPUs, controladors i mem&#242;ria
! addicionals. A l'utilitzar la tecnologia de clustering, els clients podran
! afegir gradualment sistemes est&#224;ndars m&#233;s petits, segons sigui necessari, per a
  satisfer els requeriments generals de pot&#232;ncia de processament.
  \end{description}
--- 21,26 ----
  que planegen ampliar la capacitat del seu sistema han de considerar servidors
  &quot;high end&quot; costosos que proporcionen espai per a CPUs, controladors i mem&#242;ria
! addicionals. Al utilitzar la tecnologia de clustering, els clients podran
! afegir gradualment sistemes est&#224;ndards m&#233;s petits, segons sigui necessari, per a
  satisfer els requeriments generals de pot&#232;ncia de processament.
  \end{description}
***************
*** 37,41 ****
  \begin{itemize}
  \item \textbf{OpenMosix:}
! &#201;s una imlpementaci&#243; basada en la distribuci&#243; de processos, com a modificaci&#243;
  per al nucli, de forma que el proc&#233;s &#233;s totalment transparent a l'usuari (al
  programador* de l'aplicaci&#243;), cosa que fa molt m&#233;s portables els programes a
--- 37,41 ----
  \begin{itemize}
  \item \textbf{OpenMosix:}
! &#201;s una implementaci&#243; basada en la distribuci&#243; de processos, com a modificaci&#243;
  per al nucli, de forma que el proc&#233;s &#233;s totalment transparent a l'usuari (al
  programador* de l'aplicaci&#243;), cosa que fa molt m&#233;s portables els programes a
***************
*** 66,77 ****
  \nocite{Beowulf-Howto}
  Beowulf, segons una de les definicions que hem trobat (doncs alguns diuen que es
! pot dir que un sistema &#233;s Beowulf nom&#233;s si est&#224; contru&#239;t de la mateixa forma que
  la m&#224;quina original de la NASA; d'altres van cap a l'altre extrem i diuen que &#233;s
  un sistema Beowulf tot aquell conjunt de m&#224;quines que corren codi paral&#183;lel), &#233;s
! una arquitectura multi-computador que pot ser utilitzada per a fer computacoins
  en paral&#183;lel. Normalment consisteix en un node servidor i un o m&#233;s nodes
  connectats via Ethernet (o qualsevol altre xarxa), per&#242; el millor de tot &#233;s que
! es pot constru&#239;r amb hardware &quot;normal&quot;, com per exemple qualsevol PC que pugui
! utilitzar Linux, adaptadors est&#224;ndar d'Ethernet i switchos. Beowulf tamb&#233;
  utilitza software &quot;com&#250;&quot;, com el sistema operatiu Linux, PVM (Parallel Virtual
  Machine) i MPI (Message Passing Interface). Una de les grans difer&#232;ncies entre
--- 66,77 ----
  \nocite{Beowulf-Howto}
  Beowulf, segons una de les definicions que hem trobat (doncs alguns diuen que es
! pot dir que un sistema &#233;s Beowulf nom&#233;s si est&#224; constru&#239;t de la mateixa forma que
  la m&#224;quina original de la NASA; d'altres van cap a l'altre extrem i diuen que &#233;s
  un sistema Beowulf tot aquell conjunt de m&#224;quines que corren codi paral&#183;lel), &#233;s
! una arquitectura multi-computador que pot ser utilitzada per a fer computacions
  en paral&#183;lel. Normalment consisteix en un node servidor i un o m&#233;s nodes
  connectats via Ethernet (o qualsevol altre xarxa), per&#242; el millor de tot &#233;s que
! es pot construir amb hardware &quot;normal&quot;, com per exemple qualsevol PC que pugui
! utilitzar Linux, adaptadors est&#224;ndard d'Ethernet i switchos. Beowulf tamb&#233;
  utilitza software &quot;com&#250;&quot;, com el sistema operatiu Linux, PVM (Parallel Virtual
  Machine) i MPI (Message Passing Interface). Una de les grans difer&#232;ncies entre
***************
*** 88,92 ****
  eines de configuraci&#243; que fan l'arquitectura Beowulf m&#233;s r&#224;pida, m&#233;s f&#224;cil de
  configurar i molt m&#233;s usable, un pot constru&#239;r una m&#224;quina de la classe Beowulf
! utilitzant distribucions de Linux est&#224;ndars sense cap software addicional.
  Tenint un parell de m&#224;quines linux en xarxa que comparteixen com a m&#237;nim el
  /home a trav&#233;s de NFS i es confien l'una a l'altra per executar shells remotes
--- 88,92 ----
  eines de configuraci&#243; que fan l'arquitectura Beowulf m&#233;s r&#224;pida, m&#233;s f&#224;cil de
  configurar i molt m&#233;s usable, un pot constru&#239;r una m&#224;quina de la classe Beowulf
! utilitzant distribucions de Linux est&#224;ndards sense cap software addicional.
  Tenint un parell de m&#224;quines linux en xarxa que comparteixen com a m&#237;nim el
  /home a trav&#233;s de NFS i es confien l'una a l'altra per executar shells remotes
***************
*** 98,105 ****
  exemple, OpenMosix (tot i que aquest &#250;ltim &#233;s totalment transparent a l'usuari).
  
- De totes maneres,
  
  
! \item \textbf{Altre soft de clustering:}
  Tot i buscar per Internet la exist&#232;ncia d'altre software de clustering, no hem trobat res excepte distribucions basades en el software que ja hem comentat.
  \end{itemize}
--- 98,104 ----
  exemple, OpenMosix (tot i que aquest &#250;ltim &#233;s totalment transparent a l'usuari).
  
  
  
! \item \textbf{Altre software de clustering:}
  Tot i buscar per Internet la exist&#232;ncia d'altre software de clustering, no hem trobat res excepte distribucions basades en el software que ja hem comentat.
  \end{itemize}
***************
*** 135,140 ****
  anomenat pooch \cite{AltresSO-MacOS} es pot crear un cluster amb
  aquest sistema operatiu. Com passa a Beowulf per Linux, aquest sistema de
! clustering est&#224; basat en l'&#250;s de biblioteques de paral.leliitzaci&#243; i per tant
! els programes s'haur&#225;n d'escriure penssant que s'executen en un cluster no &#233;s
  transparent a l'usuari/aplicaci&#243;.
  \end{itemize}
--- 134,139 ----
  anomenat pooch \cite{AltresSO-MacOS} es pot crear un cluster amb
  aquest sistema operatiu. Com passa a Beowulf per Linux, aquest sistema de
! clustering est&#224; basat en l'&#250;s de biblioteques de paral&#183;leliitzaci&#243; i per tant
! els programes s'hauran d'escriure pensant que s'executen en un cluster no &#233;s
  transparent a l'usuari/aplicaci&#243;.
  \end{itemize}
***************
*** 147,151 ****
  Els translators s&#243;n servidors de Hurd (SO basat en el micronucli gnuMach, tot i
  que s'est&#224; migrant cap a oskit-Mach i, en un futur, cap a L4) que proporcionen
! la interf&#237;cies b&#224;sica del sistema de fitxers, de manera que es poden insertar
  entre el contingut real d'un fitxer (entenent com a fitxer la representaci&#243;
  corresponent en el sistema de fitxers - inode -, doncs el fitxer real pot estar
--- 146,150 ----
  Els translators s&#243;n servidors de Hurd (SO basat en el micronucli gnuMach, tot i
  que s'est&#224; migrant cap a oskit-Mach i, en un futur, cap a L4) que proporcionen
! la interf&#237;cies b&#224;sica del sistema de fitxers, de manera que es poden inserir
  entre el contingut real d'un fitxer (entenent com a fitxer la representaci&#243;
  corresponent en el sistema de fitxers - inode -, doncs el fitxer real pot estar
***************
*** 166,170 ****
  restringits al t&#237;pic conjunt d'objectes (fitxer de dispositiu, link, etc.), s&#243;n
  lliures de retornar qualsevol cosa que tingui sentit per al programador.  Un
! exemple podria ser un translator que es comport&#233;s com un directori quan f&#243;s
  accedit per \texttt{cd} o \texttt{ls} per&#242; que al mateix temps es comport&#233;s com
  un fitxer al ser accedit per \texttt{cat}.
--- 165,169 ----
  restringits al t&#237;pic conjunt d'objectes (fitxer de dispositiu, link, etc.), s&#243;n
  lliures de retornar qualsevol cosa que tingui sentit per al programador.  Un
! exemple podria ser un translator que es comport&#233;s com un directori quan fos
  accedit per \texttt{cd} o \texttt{ls} per&#242; que al mateix temps es comport&#233;s com
  un fitxer al ser accedit per \texttt{cat}.
***************
*** 182,187 ****
  
  /proc &#233;s realment un mirall on s'hi veuen reflectides algunes de les
! esctructures del nucli del sistema operatiu, i per mitj&#224; del qual podem
! controlar alguns par&#224;metres de seguretat tan f&#224;cilment com resulta interectuar
  amb sistema de fitxers real.
  
--- 181,186 ----
  
  /proc &#233;s realment un mirall on s'hi veuen reflectides algunes de les
! estructures del nucli del sistema operatiu, i per mitj&#224; del qual podem
! controlar alguns par&#224;metres de seguretat tan f&#224;cilment com resulta interactuar
  amb sistema de fitxers real.
  
***************
*** 189,193 ****
  \subsubsection {M&#233;s sobre /proc}
  
! /proc est&#225; disponible en el sistema operatiu Linux quan el nucli es compila amb
  la opci&#243; CONFIG\_PROC\_FS=Y. Tamb&#233; haurem de seleccionar la opci&#243;
  CONFIG\_SYSCTL=Y per a poder modificar el valor de determinats par&#224;metres.
--- 188,192 ----
  \subsubsection {M&#233;s sobre /proc}
  
! /proc est&#224; disponible en el sistema operatiu Linux quan el nucli es compila amb
  la opci&#243; CONFIG\_PROC\_FS=Y. Tamb&#233; haurem de seleccionar la opci&#243;
  CONFIG\_SYSCTL=Y per a poder modificar el valor de determinats par&#224;metres.
***************
*** 235,239 ****
  l'usuari. De fet, la majoria s&#243;n valors de nom&#233;s lectura i altres s&#243;n molt
  millor controlar-los per mitj&#224; del nucli amb la utilitzaci&#243; de les divers
! funcions i eienes existents al sistema.
  
  
--- 234,238 ----
  l'usuari. De fet, la majoria s&#243;n valors de nom&#233;s lectura i altres s&#243;n molt
  millor controlar-los per mitj&#224; del nucli amb la utilitzaci&#243; de les divers
! funcions i eines existents al sistema.
  
  

Index: 03.tex
===================================================================
RCS file: /cvsroot/taca/doc/03.tex,v
retrieving revision 1.5
retrieving revision 1.6
diff -C2 -d -r1.5 -r1.6
*** 03.tex	17 Jun 2004 19:23:39 -0000	1.5
--- 03.tex	19 Jun 2004 13:24:15 -0000	1.6
***************
*** 14,51 ****
  \item Consultar c&#224;rrega del node
  \item Consultar estat de mem&#242;ria
! \item Bloquejar l'arribada de nous processos remots
! \item Bloquejar la migracio de processos locals
! \item Activar/Desactivar la migraci&#243; automatica de processos
! \item Demanar que els processos que ha creat un node i han migrat, tornin  a
  aquest node (come back home)
! \item Expulsar els &quot;processos convidats&quot; a casa
  \item Saber quin identificador te un node
  \item Modificar/Consultar la velocitat d'un node
! \item Consultar informacio de processos (resum de l'estat de processos locals, i
  remots)
  \item Consultar resum de l'estat del node
  \end{itemize}
  
! \subsection {A nivell de proces...}
  \begin{itemize}
! \item Moure processos d'un node a un altre \\
! 	=&gt; Esborrar els fitxers relatius al proces del node origen \\
! 	=&gt; Generar els fitxers relatius al proces al node desti
! \item Bloquejar un proces en un node concret
! \item Crear un nou proces en una maquina (crear un fitxer) \\
! 	=&gt; Generar els fitxers relatius al proces en aquest node.
! \item Matar un proces (esborrar un fitxer) \\
! 	=&gt; Esborrar els fitxers relatius al proces al node on s'esta executant.
! \item Copiar un proces (arrencar una nova execuci&#243; del programa)
! \item Modificar/veure memoria del proces
! \item Consultar la linia de comandes amb la que s'ha executat
! \item Consultar estat del proces
! \item Consultar quants cops s'ha migrat el proces
! \item Consultar on s'esta computant actualment
  \item Consultar quin node el va crear
! \item Saber l'identificador de proces (ID global)
! \item Saber l'identificador local d'un proces (ex: PID)
  \item Consultar resum de us de CPU
! \item Consultar resum de us de Memoria
  \end{itemize}
  
--- 14,51 ----
  \item Consultar c&#224;rrega del node
  \item Consultar estat de mem&#242;ria
! \item Bloquejar l'arribada de nous proc&#233;ssos remots
! \item Bloquejar la migraci&#243; de proc&#233;ssos locals
! \item Activar/Desactivar la migraci&#243; autom&#224;tica de proc&#233;ssos
! \item Demanar que els proc&#233;ssos que ha creat un node i han migrat, tornin  a
  aquest node (come back home)
! \item Expulsar els &quot;proc&#233;ssos convidats&quot; a casa
  \item Saber quin identificador te un node
  \item Modificar/Consultar la velocitat d'un node
! \item Consultar informaci&#243; de proc&#233;ssos (resum de l'estat de proc&#233;ssos locals, i
  remots)
  \item Consultar resum de l'estat del node
  \end{itemize}
  
! \subsection {A nivell de proc&#233;s ...}
  \begin{itemize}
! \item Moure proc&#233;ssos d'un node a un altre \\
! 	=&gt; Esborrar els fitxers relatius al proc&#233;s del node origen \\
! 	=&gt; Generar els fitxers relatius al proc&#233;s al node dest&#237;
! \item Bloquejar un proc&#233;s en un node concret
! \item Crear un nou proc&#233;s en una maquina (crear un fitxer) \\
! 	=&gt; Generar els fitxers relatius al proc&#233;s en aquest node.
! \item Matar un proc&#233;s (esborrar un fitxer) \\
! 	=&gt; Esborrar els fitxers relatius al proc&#233;s al node on s'est&#224; executant.
! \item Copiar un proc&#233;s (arrencar una nova execuci&#243; del programa)
! \item Modificar/veure mem&#242;ria del proc&#233;s
! \item Consultar la l&#237;nia de comandes amb la que s'ha executat
! \item Consultar estat del proc&#233;s
! \item Consultar quants cops s'ha migrat el proc&#233;s
! \item Consultar on s'est&#224; computant actualment
  \item Consultar quin node el va crear
! \item Saber l'identificador de proc&#233;s (ID global)
! \item Saber l'identificador local d'un proc&#233;s (ex: PID)
  \item Consultar resum de us de CPU
! \item Consultar resum de us de Mem&#242;ria
  \end{itemize}
  
***************
*** 57,61 ****
  \subsubsection{OpenMosix}
  
! El software que volem contru&#239;r est&#224; lligat al node on s'executa per la definici&#243;
  de l'arquitectura d'OpenMosix, fem difer&#232;ncia entre node local i nodes remots.
  
--- 57,61 ----
  \subsubsection{OpenMosix}
  
! El software que volem construir est&#224; lligat al node on s'executa per la definici&#243;
  de l'arquitectura d'OpenMosix, fem difer&#232;ncia entre node local i nodes remots.
  
***************
*** 63,71 ****
  troba l'usuari), la resta s&#243;n els nodes remots.
  
! Per aquest motiu, suposarem que tots els processos tenen com a punt d'entrada
  (s'inicia la seva execuci&#243;) en el node local (que &#233;s la soluci&#243; adoptada en la
  majoria dels centres on s'utilitza OpenMosix).
  
! Fem aquesta suposici&#243; precisament perqu&#232; els processos que tenen un node
  \textit{home} (el node des d'on es llencen) diferent del node local ofereixen
  menys possibilitats d'administraci&#243; i monitoritzaci&#243;.
--- 63,71 ----
  troba l'usuari), la resta s&#243;n els nodes remots.
  
! Per aquest motiu, suposarem que tots els proc&#233;ssos tenen com a punt d'entrada
  (s'inicia la seva execuci&#243;) en el node local (que &#233;s la soluci&#243; adoptada en la
  majoria dels centres on s'utilitza OpenMosix).
  
! Fem aquesta suposici&#243; precisament perqu&#232; els proc&#233;ssos que tenen un node
  \textit{home} (el node des d'on es llencen) diferent del node local ofereixen
  menys possibilitats d'administraci&#243; i monitoritzaci&#243;.
***************
*** 89,103 ****
  \item Consultar estat de memoria \\
  	Consultant el fitxer /proc/hpc/nodes/\textless opMosix\_ID\textgreater/mem
! \item Bloquejar l'arribada de nous processos remots (tant el node local com els
  altres) \\
  	Consultant el fitxer /proc/hpc/admin/block
! \item Bloquejar la migracio de processos locals \\
  	Bloquejar cada proc&#233;s del node (mirar seg&#252;ent secci&#243;)
! \item Activar/Desactivar la migraci&#243; automatica de processos \\
  	Modificar el fitxer /proc/hpc/admin/stay
! \item Demanar que els processos que ha creat un node i han migrat, tornin  a
  aquest node (come back home) \\
  	Modificar el fitxer /proc/hpc/admin/bring
! \item Expulsar els &quot;processos convidats&quot; a casa \\
  	Modificar el fitxer /proc/hpc/admin/expel
  \item Saber quin identificador t&#233; un node \\
--- 89,103 ----
  \item Consultar estat de memoria \\
  	Consultant el fitxer /proc/hpc/nodes/\textless opMosix\_ID\textgreater/mem
! \item Bloquejar l'arribada de nous proc&#233;ssos remots (tant el node local com els
  altres) \\
  	Consultant el fitxer /proc/hpc/admin/block
! \item Bloquejar la migraci&#243; de proc&#233;ssos locals \\
  	Bloquejar cada proc&#233;s del node (mirar seg&#252;ent secci&#243;)
! \item Activar/Desactivar la migraci&#243; autom&#224;tica de proc&#233;ssos \\
  	Modificar el fitxer /proc/hpc/admin/stay
! \item Demanar que els proc&#233;ssos que ha creat un node i han migrat, tornin  a
  aquest node (come back home) \\
  	Modificar el fitxer /proc/hpc/admin/bring
! \item Expulsar els &quot;proc&#233;ssos convidats&quot; a casa \\
  	Modificar el fitxer /proc/hpc/admin/expel
  \item Saber quin identificador t&#233; un node \\
***************
*** 106,113 ****
  \item Modificar/Consultar la velocitat d'un node \\
  	Consultar el fitxer /proc/hpc/admin/speed
! \item Consultar informacio de processos (resum de l'estat de processos locals, i
  remots) \\
  	Generar un resum consultant la informaci&#243; de cada proc&#233;s del node amb les
! operacions de consulta de informaci&#243; de proces (mirar seg&#252;ent secci&#243;)
  \item Consultar resum de l'estat del node \\
  	Generar un resum amb la informaci&#243; sobre el node descrita a les funcionalitats
--- 106,113 ----
  \item Modificar/Consultar la velocitat d'un node \\
  	Consultar el fitxer /proc/hpc/admin/speed
! \item Consultar informaci&#243; de proc&#233;ssos (resum de l'estat de proc&#233;ssos locals, i
  remots) \\
  	Generar un resum consultant la informaci&#243; de cada proc&#233;s del node amb les
! operacions de consulta de informaci&#243; de proc&#233;s (mirar seg&#252;ent secci&#243;)
  \item Consultar resum de l'estat del node \\
  	Generar un resum amb la informaci&#243; sobre el node descrita a les funcionalitats
***************
*** 115,147 ****
  \end{itemize}
  
! \item A nivell de proces...
  \begin{itemize}
! \item Moure processos d'un node a un altre \\
! 	Fer un \textit{migrate} del proces que volem moure al node on ha d'anar
! \item Bloquejar un proces en un node concret \\
  	Modificar el fitxer /proc/\textless PID\textgreater/lock
! \item Crear un nou proces en una maquina (crear un fitxer) \\
! 	Posar en execucio el proces al node on volem que s'executi
! \item Matar un proces (esborrar un fitxer) \\
! 	Fer un &quot;kill&quot; del proces
! \item Copiar un proces (arrencar una nova execuci&#243; del programa) \\
  	Aix&#242; no &#233;s ofert directament per OpenMosix, sin&#243; que es tracta
  	simplement de tornar a executar el programa
! \item Modificar/veure memoria del proces \\
  	Consultar el fitxer /proc/\textless PID\textgreater/mem
! \item Consultar la linia de comandes amb la que s'ha executat \\
  	Consultar el fitxer /proc/\textless PID\textgreater/cmdline
! \item Consultar estat del proces \\
  	Consultar el fitxer /proc/\textless PID\textgreater/status
! \item Consultar quants cops s'ha migrat el proces \\
  	Consultar el fitxer /proc/\textless PID\textgreater/nmigs
! \item Consultar on s'esta computant actualment \\
  	Consultar el fitxer /proc/\textless PID\textgreater/where (o mirar el directori pare)
! \item Consultar quin node va crear el proces \\
  	Segons la suposici&#243; inicial, tots es creen al node local
! \item Saber l'identificador de proces (ID global) \\
  	El propi \textit{PID} ens serveix d'ID global perqu&#232; el propi OpenMosix
  	ja s'encarrega de mantenir la coher&#232;ncia
! \item Saber l'identificador local d'un proces \\
  	En OpenMosix tots els identificadors dels processos migrables s&#243;n
  	globals, de forma que ja s&#243;n els mateixos que els locals (es troben a
--- 115,147 ----
  \end{itemize}
  
! \item A nivell de proc&#233;s...
  \begin{itemize}
! \item Moure proc&#233;ssos d'un node a un altre \\
! 	Fer un \textit{migrate} del proc&#233;s que volem moure al node on ha d'anar
! \item Bloquejar un proc&#233;s en un node concret \\
  	Modificar el fitxer /proc/\textless PID\textgreater/lock
! \item Crear un nou proc&#233;s en una maquina (crear un fitxer) \\
! 	Posar en execuci&#243; el proc&#233;s al node on volem que s'executi
! \item Matar un proc&#233;s (esborrar un fitxer) \\
! 	Fer un &quot;kill&quot; del proc&#233;s
! \item Copiar un proc&#233;s (arrencar una nova execuci&#243; del programa) \\
  	Aix&#242; no &#233;s ofert directament per OpenMosix, sin&#243; que es tracta
  	simplement de tornar a executar el programa
! \item Modificar/veure mem&#242;ria del proc&#233;s \\
  	Consultar el fitxer /proc/\textless PID\textgreater/mem
! \item Consultar la l&#237;nia de comandes amb la que s'ha executat \\
  	Consultar el fitxer /proc/\textless PID\textgreater/cmdline
! \item Consultar estat del proc&#233;s \\
  	Consultar el fitxer /proc/\textless PID\textgreater/status
! \item Consultar quants cops s'ha migrat el proc&#233;s \\
  	Consultar el fitxer /proc/\textless PID\textgreater/nmigs
! \item Consultar on s'est&#224; computant actualment \\
  	Consultar el fitxer /proc/\textless PID\textgreater/where (o mirar el directori pare)
! \item Consultar quin node va crear el proc&#233;s \\
  	Segons la suposici&#243; inicial, tots es creen al node local
! \item Saber l'identificador de proc&#233;s (ID global) \\
  	El propi \textit{PID} ens serveix d'ID global perqu&#232; el propi OpenMosix
  	ja s'encarrega de mantenir la coher&#232;ncia
! \item Saber l'identificador local d'un proc&#233;s \\
  	En OpenMosix tots els identificadors dels processos migrables s&#243;n
  	globals, de forma que ja s&#243;n els mateixos que els locals (es troben a
***************
*** 160,164 ****
  Tal com s'ha explicat anteriorment, Beowulf &#233;s una arquitectura i no un paquet
  de software, de manera que hi ha diverses eines o distribucions que permeten
! contru&#239;r aquesta arquitectura:
  
  \begin{itemize}
--- 160,164 ----
  Tal com s'ha explicat anteriorment, Beowulf &#233;s una arquitectura i no un paquet
  de software, de manera que hi ha diverses eines o distribucions que permeten
! construir aquesta arquitectura:
  
  \begin{itemize}

Index: 04.tex
===================================================================
RCS file: /cvsroot/taca/doc/04.tex,v
retrieving revision 1.3
retrieving revision 1.4
diff -C2 -d -r1.3 -r1.4
*** 04.tex	17 Jun 2004 19:23:39 -0000	1.3
--- 04.tex	19 Jun 2004 13:24:15 -0000	1.4
***************
*** 12,17 ****
  ofereix el software de clustering.
  
! Per exemple, quan es vol migrar un proces, es a dir, es vol moure un fitxer que
! representa el proces en el sistema de fitxers que ofereix TACA, d'un node a un
  altre, el que faria el software del nostre m&#242;dul seria utilitzar la comanda
  &quot;migrate&quot; de les \textit{OpenMosix Tools} (utilitats de clustering).
--- 12,17 ----
  ofereix el software de clustering.
  
! Per exemple, quan es vol migrar un proc&#233;s, es a dir, es vol moure un fitxer que
! representa el proc&#233;s en el sistema de fitxers que ofereix TACA, d'un node a un
  altre, el que faria el software del nostre m&#242;dul seria utilitzar la comanda
  &quot;migrate&quot; de les \textit{OpenMosix Tools} (utilitats de clustering).
***************
*** 39,43 ****
  Aquest disseny, respecte l'anterior, aporta independ&#232;ncia respecte les OpenMosix
  Tools i efici&#232;ncia ja que no cal que cada cop que volem fer alguna operaci&#243;
! haguem de crear un proc&#233;s que executi una comanda de les utilitats de
  clustering.
  
--- 39,43 ----
  Aquest disseny, respecte l'anterior, aporta independ&#232;ncia respecte les OpenMosix
  Tools i efici&#232;ncia ja que no cal que cada cop que volem fer alguna operaci&#243;
! hagim de crear un proc&#233;s que executi una comanda de les utilitats de
  clustering.
  
***************
*** 121,133 ****
          |   |-- ncpu		Numero de CPUs al node
          |   |-- load		Carrega del node
!         |   |-- mem		Estat de la memoria
          |   |-- block_new	Bloqueja l'arribada de processos nous
          |   |-- block_mig	Bloqueja la migraci&#243; de processos locals
!         |   |-- auto_mig	Bloqueja la migracio automatica de processos
          |   |-- come_home	Fa que els processos que ha llen&#231;at aquest node tornin
          |   |-- go_home		Expulsar els processos convidats
          |   |-- speed		Velocitat del node
          |   `-- status		Estat del node i dels processos
!         `-- &lt;IDProces&gt;
              |-- block           Bloqueja el proc&#233;s en el node actual
              |-- mem		Mem&#242;ria del proc&#233;s
--- 121,133 ----
          |   |-- ncpu		Numero de CPUs al node
          |   |-- load		Carrega del node
!         |   |-- mem		Estat de la mem&#242;ria
          |   |-- block_new	Bloqueja l'arribada de processos nous
          |   |-- block_mig	Bloqueja la migraci&#243; de processos locals
!         |   |-- auto_mig	Bloqueja la migraci&#243; autom&#224;tica de processos
          |   |-- come_home	Fa que els processos que ha llen&#231;at aquest node tornin
          |   |-- go_home		Expulsar els processos convidats
          |   |-- speed		Velocitat del node
          |   `-- status		Estat del node i dels processos
!         `-- &lt;IDproc&#233;s&gt;
              |-- block           Bloqueja el proc&#233;s en el node actual
              |-- mem		Mem&#242;ria del proc&#233;s

Index: 05.tex
===================================================================
RCS file: /cvsroot/taca/doc/05.tex,v
retrieving revision 1.2
retrieving revision 1.3
diff -C2 -d -r1.2 -r1.3
*** 05.tex	17 Jun 2004 19:23:39 -0000	1.2
--- 05.tex	19 Jun 2004 13:24:15 -0000	1.3
***************
*** 13,17 ****
  
  A l'hora de crear la implementaci&#243;, hem pensat en un objectiu molt concret per
! tal de redu&#239;r el tamany de la implementaci&#243; (doncs fer-la completa requereix
  molt de temps i no &#233;s l'objectiu d'aquesta pr&#224;ctica).
  
--- 13,17 ----
  
  A l'hora de crear la implementaci&#243;, hem pensat en un objectiu molt concret per
! tal de reduir el tamany de la implementaci&#243; (doncs fer-la completa requereix
  molt de temps i no &#233;s l'objectiu d'aquesta pr&#224;ctica).
  
***************
*** 32,36 ****
  File System}) que proporciona Linux.
  
! Al ser un sistema de fitxers virtual, tota la inforaci&#243; mostrada es genera de
  forma din&#224;mica amb les dades obtingudes del \textit{backend}.
  
--- 32,36 ----
  File System}) que proporciona Linux.
  
! Al ser un sistema de fitxers virtual, tota la informaci&#243; mostrada es genera de
  forma din&#224;mica amb les dades obtingudes del \textit{backend}.
  
***************
*** 166,170 ****
  \subsubsection{Exemple \textit{dummy}}
  
! Primerament hem implementat un petit backend d'exemple que crea sempre les
  mateixes dades per tal de comprovar que la part que hem implementat del
  \textit{frontend} funciona correctament, &#233;s a dir, tenim un sistema de fitxers
--- 166,170 ----
  \subsubsection{Exemple \textit{dummy}}
  
! Primerament hem implementat un petit \textit{backend} d'exemple que crea sempre les
  mateixes dades per tal de comprovar que la part que hem implementat del
  \textit{frontend} funciona correctament, &#233;s a dir, tenim un sistema de fitxers
***************
*** 183,187 ****
  \verb&quot;/proc/hpc&quot;, sense exportar cap s&#237;mbol utilitzable des del propi nucli, de
  forma que l'&#250;nica manera d'accedir-hi &#233;s a trav&#233;s del VFS, el qual nom&#233;s &#233;s
! accessible a trav&#233;s de programes amb un contexte propi (com serien programes en
  mode usuari o threads de kernel).
  
--- 183,187 ----
  \verb&quot;/proc/hpc&quot;, sense exportar cap s&#237;mbol utilitzable des del propi nucli, de
  forma que l'&#250;nica manera d'accedir-hi &#233;s a trav&#233;s del VFS, el qual nom&#233;s &#233;s
! accessible a trav&#233;s de programes amb un context propi (com serien programes en
  mode usuari o threads de kernel).
  
***************
*** 213,220 ****
  d'OpenMosix i exportar aquestes funcions que ens proporcionarien just el que
  volem, que seria com una extensi&#243; del nostre \textit{backend} que entraria a
! dins del codi.
  \\
  A m&#233;s a m&#233;s aquestes dues &#250;ltimes solucions no s&#243;n molt viables pel fet de qu&#232; la
! documentaci&#243; tant externa com a dins del propi codi &#233;s molt minsa.
  
  \item
--- 213,220 ----
  d'OpenMosix i exportar aquestes funcions que ens proporcionarien just el que
  volem, que seria com una extensi&#243; del nostre \textit{backend} que entraria a
! dins del codi del kernel.
  \\
  A m&#233;s a m&#233;s aquestes dues &#250;ltimes solucions no s&#243;n molt viables pel fet de qu&#232; la
! documentaci&#243; d'OpenMosix tant externa com a dins del propi codi &#233;s molt minsa.
  
  \item


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000054.html">[Taca-cvs] codi Makefile,1.1,NONE generic.h,1.2,NONE inode.c,1.1,NONE linux_tacafs.c,1.1,NONE mosix.c,1.4,NONE rkfs.c,1.3,NONE
</A></li>
	<LI>Next message: <A HREF="000056.html">[Taca-cvs] doc 00-taca.tex,1.3,1.4
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#55">[ date ]</a>
              <a href="thread.html#55">[ thread ]</a>
              <a href="subject.html#55">[ subject ]</a>
              <a href="author.html#55">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/taca-cvs">More information about the Taca-cvs
mailing list</a><br>
</body></html>
